Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/openfoam_2d_caseA/system/blockMeshDict
/* 2-D vertical-plane representation of Vasconcelos & Wright (2011), Case A.
   Exact axial dimensions: 0.546 + 2.970 + 0.490 m; pipe D=0.094 m;
   tower Dt=0.0571 m, L=0.610 m, centred at x=3.516 m. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale   1;

vertices
(
    (0       -0.047 -0.002) // 0
    (0        0.047 -0.002) // 1
    (0       -0.047  0.002) // 2
    (0        0.047  0.002) // 3

    (0.546   -0.047 -0.002) // 4 valve plane
    (0.546    0.047 -0.002) // 5
    (0.546   -0.047  0.002) // 6
    (0.546    0.047  0.002) // 7

    (3.48745 -0.047 -0.002) // 8 tower left
    (3.48745  0.047 -0.002) // 9
    (3.48745 -0.047  0.002) // 10
    (3.48745  0.047  0.002) // 11

    (3.54455 -0.047 -0.002) // 12 tower right
    (3.54455  0.047 -0.002) // 13
    (3.54455 -0.047  0.002) // 14
    (3.54455  0.047  0.002) // 15

    (4.006   -0.047 -0.002) // 16 downstream closed end
    (4.006    0.047 -0.002) // 17
    (4.006   -0.047  0.002) // 18
    (4.006    0.047  0.002) // 19

    (3.48745  0.657 -0.002) // 20 tower open top
    (3.48745  0.657  0.002) // 21
    (3.54455  0.657 -0.002) // 22
    (3.54455  0.657  0.002) // 23
);

blocks
(
    hex (0 4 5 1 2 6 7 3)       (136 24 1) simpleGrading (1 1 1)
    hex (4 8 9 5 6 10 11 7)     (735 24 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (14  24 1) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15) (115 24 1) simpleGrading (1 1 1)
    hex (9 13 22 20 11 15 23 21)  (14 152 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 2 3 1)
            (17 19 18 16)

            (4 6 2 0)
            (8 10 6 4)
            (12 14 10 8)
            (16 18 14 12)

            (1 3 7 5)
            (5 7 11 9)
            (13 15 19 17)

            (9 11 21 20)
            (22 23 15 13)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (2 6 7 3)
            (4 5 9 8)
            (6 10 11 7)
            (8 9 13 12)
            (10 14 15 11)
            (12 13 17 16)
            (14 18 19 15)
            (9 13 22 20)
            (11 15 23 21)
        );
    }
);

// ************************************************************************* //
